In [1]:
!conda install -yc conda-forge ipython-sql

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [3]:
%%sql
select * 
from facts 
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql
SELECT MIN(population) as 'Minimum population',
MAX(population) as 'Maximum population',  
MIN(population_growth) as 'Min population growth',
MAX(population_growth) as 'Min Population growth'
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [15]:
%%sql
SELECT f.name, f.population 
FROM facts AS f
WHERE not (f.population = 'None')
AND not (name = 'World')
ORDER BY f.population ASC 
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('Antarctica', 0),
 ('Pitcairn Islands', 48),
 ('Cocos (Keeling) Islands', 596),
 ('Holy See (Vatican City)', 842),
 ('Niue', 1190)]

In [16]:
%%sql
SELECT f.name, f.population 
FROM facts AS f
WHERE not (f.population = 'None')
AND not (name = 'World')
ORDER BY f.population DESC 
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864),
 ('Indonesia', 255993674)]

In [18]:
%%sql
SELECT MIN(population) as 'Minimum population',
MAX(population) as 'Maximum population',  
MIN(population_growth) as 'Min population growth',
MAX(population_growth) as 'Min Population growth'
FROM facts
WHERE not (population = 'None')
AND not (name = 'World');

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [20]:
%%sql
SELECT round(AVG(population),2) as average_population , round(AVG(area),2) as average_area
FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928.32, 555093.55)]

In [23]:
%%sql
SELECT name , population , area
FROM facts 
WHERE population > (SELECT AVG(population) FROM facts)
AND area < (SELECT AVG(area) FROM facts) ;

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

Which country has the most people? Which country has the highest growth rate?

In [24]:
%%sql
SELECT name , MAX(population)
FROM facts WHERE not (name = 'World')

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

In [25]:
%%sql
SELECT name , MAX(population_growth)
FROM facts WHERE not (name = 'World')

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

Which countries have the highest ratios of water to land? 
Which countries have more water than land?

In [28]:
%%sql
SELECT name , cast(area_water as float)/cast(area_land as float) AS water_land_ratio
from facts
ORDER BY cast(area_water as float)/cast(area_land as float) DESC
LIMIT 5

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623)]

Which countries will add the most people to their populations next year? - Countries with the highest growth rate like South Sudan as shown above

Which countries have a higher death rate than birth rate?

In [ ]:
%%sql
SELECT name , death_rate , birth_rate
FROM facts
WHERE death_rate > birth_rate 
ORDER BY ;